Revit 2024 API
GroupTypeId.SplitProfileDimensions Property
 Dimensions (linear units or % of thickness).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public static ForgeTypeId SplitProfileDimensions { get; }
Visual Basic
Public Shared ReadOnly Property SplitProfileDimensions As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ SplitProfileDimensions {
	ForgeTypeId^ get ();
}
See Also
GroupTypeId Class
Autodesk.Revit.DB Namespace